tutorialsDyM/2DCylinderUniformGranularFlow/Case1D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


scale 1;

d 0.0015;
D #calc "$d*3.3/2"; //this is the radius!
h #calc "$D*16*2*1.2+1";
L #calc "$d*110";
NegL #calc "-$d*30";
H #calc "$d*120";

factor_Detp #calc "-0*8*$D";

NegH #calc "$h-$H";
NegD #calc "-$d*3.3/2.";
NegDY #calc "-$d*3.3/2.+$factor_Detp";

vertices
(
($L $h -0.005) //0
($NegL $h -0.005) //1
($L $h 0.005) //2
($NegL $h  0.005) //3
($L $NegH -0.005) //4
($NegL $NegH -0.005)// // 5
($L $NegH 0.005)// 6
($NegL $NegH 0.005)// 7
 ) ;


blocks
(
hex (0 1 5 4 2 3 7 6) (1 150 1) simpleGrading (5.5 1 1) //0 
 ) ;

 edges
 (
 
 ) ;
 

 boundary
 (

 top
 {
 type patch ;
faces
 (
 (0 1 3 2)

 ) ;
 }

 bottom
 {
 type patch ;
faces
 (
 (4 6 7 5)
 ) ;
 }

 inlet
 {
     type   cyclic;
     neighbourPatch outlet;
 faces
 (
 (1 5 7 3)
 ) ;
 }

 outlet
 {
     type   cyclic;
     neighbourPatch inlet;
 faces
 (
 (0 2 6 4)
 ) ;
 }



 frontAndBack
 {
 type empty ;
 faces
 (
 (2 3 7 6)
 (0 4 5 1)
 ) ;
 }
 ) ;

 mergePatchPairs
 (
 ) ;
	
	
	
	
	


// ************************************************************************* //
