tutorialsDyM/2DCylinderUniformGranularFlow/Case1D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| ========= | | \\ / F ield | OpenFOAM: The Open Source CFD Toolbox |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     sedFoam_rbgh;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         3.;

deltaT          1e-9;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable on;

adjustTimeStep  yes;

maxCo           0.01;

maxAlphaCo      0.01;

maxDeltaT       1e-4;


 
// ************************************************************************* //
